In [1]:
import numpy as np 
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)
                   })
dframe

   dataset1  dataset2 k1     k2
0  0.853658  0.974642  X  alpha
1 -0.597559 -0.885688  X   beta
2 -0.815589  1.211758  Y  alpha
3  1.623341 -2.433631  Y   beta
4  0.870709 -0.440386  Z  alpha

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    0.128049
Y    0.403876
Z    0.870709
Name: dataset1, dtype: float64

In [6]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['Jan','Feb','Jan','Feb','Jan'])

In [7]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  Feb   -0.597559
    Jan   -0.815589
NY  Feb    1.623341
    Jan    0.862184
Name: dataset1, dtype: float64

In [8]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.128049  0.044477
Y   0.403876 -0.610936
Z   0.870709 -0.440386

In [9]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.853658  0.974642
   beta  -0.597559 -0.885688
Y  alpha -0.815589  1.211758
   beta   1.623341 -2.433631
Z  alpha  0.870709 -0.440386

In [11]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [17]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group"%name)
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.853658  0.974642  X  alpha
1 -0.597559 -0.885688  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.815589  1.211758  Y  alpha
3  1.623341 -2.433631  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.870709 -0.440386  Z  alpha

In [19]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("key1 = %s, key2 = %s "%(k1, k2))
    print(group)
    print("\n")

key1 = X, key2 = alpha
   dataset1  dataset2 k1     k2
0  0.853658  0.974642  X  alpha


key1 = X, key2 = beta
   dataset1  dataset2 k1    k2
1 -0.597559 -0.885688  X  beta


key1 = Y, key2 = alpha
   dataset1  dataset2 k1     k2
2 -0.815589  1.211758  Y  alpha


key1 = Y, key2 = beta
   dataset1  dataset2 k1    k2
3  1.623341 -2.433631  Y  beta


key1 = Z, key2 = alpha
   dataset1  dataset2 k1     k2
4  0.870709 -0.440386  Z  alpha

In [20]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict

{'X':    dataset1  dataset2 k1     k2
 0  0.853658  0.974642  X  alpha
 1 -0.597559 -0.885688  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2 -0.815589  1.211758  Y  alpha
 3  1.623341 -2.433631  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4  0.870709 -0.440386  Z  alpha}

In [21]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.853658  0.974642  X  alpha
1 -0.597559 -0.885688  X   beta

In [22]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis = 1)))

In [23]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.853658  0.974642
 1 -0.597559 -0.885688
 2 -0.815589  1.211758
 3  1.623341 -2.433631
 4  0.870709 -0.440386, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [24]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.974642
   beta  -0.885688
Y  alpha  1.211758
   beta  -2.433631
Z  alpha -0.440386